"""
Практическая работа по уроку "Организация программ и методы строк"


Цель: Написать программу на языке Python с использованием Pycharm для работы с методами строк и организации программ.


1. В проекте, где вы решаете домашние задания, создайте модуль 'module_1_4.py' и напишите весь код в нём.


2. Организуйте программу:

   - Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
   - Вывести количество символов введённого текста

3. Работа с методами строк:
Используя методы строк, выполните следующие действия:

    - Выведите строку my_string в верхнем регистре.
    - Выведите строку my_string в нижнем регистре.
    - Измените строку my_string, удалив все пробелы.
    - Выведите первый символ строки my_string.
    - Выведите последний символ строки my_string.

"""

my_string = input("Напишите любую строку: ")
print('Количество символов в вашей строке:\t', len(my_string))
print('Ваша строка в верхнем регистре:\t\t', my_string.upper())
print('Ваша строка в нижнем регистре:\t\t', my_string.lower())
print('Ваша строка без пробелов:\t\t\t', my_string.replace(' ', ''))
print('Первый символ вашей строки\t\t\t', my_string[0])
print('Последний символ вашей строки:\t\t', my_string[-1])
